Австралия/src/InformationRegisters/AccountingPolicy/AccountingPolicy.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccountingPolicy</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>RegisteredForVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostVATEntriesBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostAdvancePaymentsBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IssueAutomaticallyAgainstSales</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DefaultVATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </resources>
  <resources>
    <name>CashMethodOfAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryValuationMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnFromCustomer</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnToSupplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>StockTransactionsMethodology</name>
    <type>
      <types>EnumRef.StockTransactionsMethodology</types>
    </type>
  </resources>
  <resources>
    <name>PostExpensesByWorkOrder</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManufacturingOverheadsAllocationMethod</name>
    <type>
      <types>EnumRef.ManufacturingOverheadsAllocationMethods</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceTotalDue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>AccountBalance</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>Overdue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>VATRoundingRule</name>
    <type>
      <types>EnumRef.VATRoundingRules</types>
    </type>
  </resources>
  <resources>
    <name>RegisteredForSalesTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnderOverAllocatedOverheadsSetting</name>
    <type>
      <types>EnumRef.UnderOverAllocatedOverheadsSettings</types>
    </type>
  </resources>
  <resources>
    <name>RegisterDeliveryDateInInvoices</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryDispatchingStrategy</name>
    <type>
      <types>EnumRef.InventoryDispatchingStrategy</types>
    </type>
  </resources>
  <resources>
    <name>AccountingPrice</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </resources>
  <resources>
    <name>UseTemplates</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>RegisterAccountingEntries</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/AccountingPolicy/RecordSetModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	NotCheckedAttributes = New Array;
	
	// begin Drive.FullVersion
	If Not GetFunctionalOption("UseProductionSubsystem") Then
	// end Drive.FullVersion
	
		NotCheckedAttributes.Add("ManufacturingOverheadsAllocationMethod");
		NotCheckedAttributes.Add("UnderOverAllocatedOverheadsSetting");
		
	// begin Drive.FullVersion	
	EndIf;
	// end Drive.FullVersion
	
	Common.DeleteNotCheckedAttributesFromArray(CheckedAttributes, NotCheckedAttributes);
	
EndProcedure

Procedure OnWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	SetPrivilegedMode(True);
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	MAX(AccountingPolicy.RegisteredForVAT) AS RegisteredForVAT,
	|	MAX(AccountingPolicy.RegisteredForSalesTax) AS RegisteredForSalesTax,
	|	MAX(NOT AccountingPolicy.PostVATEntriesBySourceDocuments) AS PostVATEntriesBySourceDocuments,
	|	MAX(NOT AccountingPolicy.PostAdvancePaymentsBySourceDocuments) AS PostAdvancePaymentsBySourceDocuments,
	|	MAX(AccountingPolicy.UseGoodsReturnFromCustomer) AS UseGoodsReturnFromCustomer,
	|	MAX(AccountingPolicy.UseGoodsReturnToSupplier) AS UseGoodsReturnToSupplier,
	|	FunctionalOptionUseVAT.Value AS CommonVAT,
	|	FunctionalOptionUseSalesTax.Value AS CommonSalesTax,
	|	UseTaxInvoices.Value AS CommonTaxInvoice,
	|	FunctionalOptionUseGoodsReturnFromCustomer.Value AS CommonGoodsReturnFromCustomer,
	|	FunctionalOptionUseGoodsReturnToSupplier.Value AS CommonGoodsReturnToSupplier
	|FROM
	|	InformationRegister.AccountingPolicy AS AccountingPolicy
	|		LEFT JOIN Constant.FunctionalOptionUseVAT AS FunctionalOptionUseVAT
	|		ON (TRUE)
	|		LEFT JOIN Constant.UseTaxInvoices AS UseTaxInvoices
	|		ON (TRUE)
	|		LEFT JOIN Constant.UseGoodsReturnFromCustomer AS FunctionalOptionUseGoodsReturnFromCustomer
	|		ON (TRUE)
	|		LEFT JOIN Constant.UseGoodsReturnToSupplier AS FunctionalOptionUseGoodsReturnToSupplier
	|		ON (TRUE)
	|		LEFT JOIN Constant.UseSalesTax AS FunctionalOptionUseSalesTax
	|		ON (TRUE)
	|
	|GROUP BY
	|	FunctionalOptionUseVAT.Value,
	|	FunctionalOptionUseSalesTax.Value,
	|	UseTaxInvoices.Value,
	|	FunctionalOptionUseGoodsReturnFromCustomer.Value,
	|	FunctionalOptionUseGoodsReturnToSupplier.Value";
	
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		
		RegisteredForVAT		= Selection.RegisteredForVAT;
		RegisteredForSalesTax	= Selection.RegisteredForSalesTax;
		UseTaxInvoices			= Selection.PostVATEntriesBySourceDocuments Or Selection.PostAdvancePaymentsBySourceDocuments;
		
		UseGoodsReturnFromCustomer	= Selection.UseGoodsReturnFromCustomer;
		UseGoodsReturnToSupplier	= Selection.UseGoodsReturnToSupplier;
		
	Else
		
		RegisteredForVAT		= False;
		RegisteredForSalesTax	= False;
		UseTaxInvoices			= False;
		
		UseGoodsReturnFromCustomer	= False;
		UseGoodsReturnToSupplier	= False;
		
	EndIf;
	
	If Selection.CommonGoodsReturnFromCustomer <> UseGoodsReturnFromCustomer Then
		Constants.UseGoodsReturnFromCustomer.Set(UseGoodsReturnFromCustomer);
	EndIf;
	
	If Selection.CommonGoodsReturnToSupplier <> UseGoodsReturnToSupplier Then
		Constants.UseGoodsReturnToSupplier.Set(UseGoodsReturnToSupplier);
	EndIf;
	
	If Selection.CommonVAT <> RegisteredForVAT Then
		Constants.FunctionalOptionUseVAT.Set(RegisteredForVAT);
	EndIf;
	
	If Selection.CommonSalesTax <> RegisteredForSalesTax Then
		Constants.UseSalesTax.Set(RegisteredForSalesTax);
	EndIf;
	
	If Selection.CommonTaxInvoice <> UseTaxInvoices Then
		Constants.UseTaxInvoices.Set(UseTaxInvoices);
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
